---
kind: method
id: M:Autodesk.Revit.DB.ConfigurationReloadInfo.GetCustomDataChangedElements
source: html/c3679f73-8888-0dc0-69e2-64bf09a09fd8.htm
---
# Autodesk.Revit.DB.ConfigurationReloadInfo.GetCustomDataChangedElements Method

Gets a list of ElementIds of fabrication parts that had custom data updated during the reload.

## Syntax (C#)
```csharp
public ISet<ElementId> GetCustomDataChangedElements()
```

## Returns
A list identifying changed elements.